posts/she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi.org
#+BEGIN_COMMENT
.. title: 设计模式学习之单例模式
.. slug: she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi
.. date: 2018-06-05 16:36:08 UTC+08:00
.. tags: design pattern, java
.. category: java
.. link: 
.. description: 
.. type: text
#+END_COMMENT

* 特点
  :PROPERTIES:
  :ID:       5178CAAD-3EB4-4C23-8A31-1A8636932EA3
  :END:
  单例模式就是确保在系统中只在一个实例提供功能。单例有好几种写法，主要有饿汉式、懒汉式、静态方法内部类、注册式单例。
* 饿汉式
  :PROPERTIES:
  :ID:       D8072892-769E-4CE2-A5C1-653E76608FA5
  :END:
  饿汉式单例就是在类定义时就已经将实例进行了初始化，在系统调用时可以直接返回不需要再实例化。示例代码如下：
  #+BEGIN_SRC java
  public class Hungry {

      private Hungry() {
      }

      private static final Hungry INSTANCE = new Hungry();

      public static Hungry getInstance() {
          return INSTANCE;
      }

  }
  #+END_SRC
  饿汉式的优点是提前进行初始化，线程安全。缺点是在系统未调用的情况下占用了内存空间，是以空间换取时间的样例
* 懒汉式
  :PROPERTIES:
  :ID:       ED1E6C8B-3D3A-486D-916B-76A252AEED07
  :END:
  懒汉式就是在使用才对对象实例进行初始化，达到了延迟加载的目的。示例代码如下：
  #+BEGIN_SRC java
  public class LazyOne {

      private LazyOne() {
      }

      private static LazyOne instance = null;

      public static LazyOne getInstance() {
          if (instance == null) {
              instance = new LazyOne();
          }
          return instance;
      }
  }
  #+END_SRC
  懒式式优化点使用时实例化，延迟加载。缺点是存在线程安全问题
{{{TEASER_END}}}
* 懒汉式（线程安全版本）
  :PROPERTIES:
  :ID:       5448AF33-6E0A-4EC7-BA2F-CA0A52F3D61A
  :END:
  上面的写法存在线程安全问题，最简单的修改方法是加上synchronized关键字，这样就解决了线程的安全问题。示例代码如下：
  #+BEGIN_SRC java
  public class LazyTwo {

      private LazyTwo() {
      }

      private static LazyTwo instance = null;

      public static synchronized LazyTwo getInstance() {
          if (instance == null) {
              instance = new LazyTwo();
          }
          return instance;
      }
  }
  #+END_SRC
  加了synchronized关键字解决了线程安全问题，但是程序的并发性能下降，因为在同一时间只能有一个线程进行工作。测试生成200万个实例的情况，不带关键字synchronized耗时7ms，而带synchroized的耗时49ms，相差7倍，加大生成实例的个数，这个时间差会更大，这个版本性能的测试代码如下：
  #+BEGIN_SRC java
  long start = System.currentTimeMillis();
  int count = 2_000_000;
  for (int i = 0; i < count; i++) {
      LazyOne.getInstance();
  }
  System.out.println("LazyOne use: " + (System.currentTimeMillis() - start) + "ms");


  long start2 = System.currentTimeMillis();
  for (int i = 0; i < count; i++) {
       LazyTwo.getInstance();
  }
  System.out.println("LazyTwo use: " + (System.currentTimeMillis() - start2) + "ms");
  #+END_SRC
