posts/she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>设计模式学习之单例模式 | I'm company</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="zh_cn" href="../../rss.xml">
<link rel="canonical" href="http://blog.imcompany.cn/posts/she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Tomyli">
<link rel="prev" href="../chang-yong-de-ideacha-jian/" title="Idea中vim键的映射" type="text/html">
<link rel="next" href="../she-ji-mo-shi-xue-xi-zhi-yuan-xing-mo-shi/" title="设计模式学习之原型模式" type="text/html">
<meta property="og:site_name" content="I'm company">
<meta property="og:title" content="设计模式学习之单例模式">
<meta property="og:url" content="http://blog.imcompany.cn/posts/she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi/">
<meta property="og:description" content="特点


单例模式就是确保在系统中只在一个实例提供功能。单例有好几种写法，主要有饿汉式、懒汉式、静态方法内部类、注册式单例。




饿汉式


饿汉式单例就是在类定义时就已经将实例进行了初始化，在系统调用时可以直接返回不需要再实例化。示例代码如下：

  public class Hungry {

      private Hungry() {
      }

      private ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-06-05T16:36:08+08:00">
<meta property="article:tag" content="design pattern">
<meta property="article:tag" content="java">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">跳到主内容</a>
    <section class="social"><ul>
<li><a href="../../index.html" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../archive.html" title="Archives"><i class="fa fa-folder-open"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="https://getnikola.com" title="About me"><i class="fa fa-user"></i></a></li>
            <li><a href="https://twitter.com/hougemeiga" title="My Twitter"><i class="fab fa-twitter"></i></a></li>
            <li><a href="https://github.com/peng051410" title="My Github"><i class="fab fa-github"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">设计模式学习之单例模式</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2018-06-05T16:36:08+08:00" itemprop="datePublished" title="2018-06-05 16:36">2018-06-05 16:36</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Tomyli
            </span></p>
                <p class="commentline"><i class="far fa-comment"></i>
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi.html">Comments</a>


            
        </p>
<p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> 资源</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> 标签:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/design-pattern/" rel="tag">design pattern</a></li>
            <li><a class="tag p-category" href="../../categories/java/" rel="tag">java</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org736830f" class="outline-2">
<h2 id="org736830f">
<a id="ID-5178CAAD-3EB4-4C23-8A31-1A8636932EA3"></a>特点</h2>
<div class="outline-text-2" id="text-org736830f">
<p>
单例模式就是确保在系统中只在一个实例提供功能。单例有好几种写法，主要有饿汉式、懒汉式、静态方法内部类、注册式单例。
</p>
</div>
</div>
<div id="outline-container-org028d48e" class="outline-2">
<h2 id="org028d48e">
<a id="ID-D8072892-769E-4CE2-A5C1-653E76608FA5"></a>饿汉式</h2>
<div class="outline-text-2" id="text-org028d48e">
<p>
饿汉式单例就是在类定义时就已经将实例进行了初始化，在系统调用时可以直接返回不需要再实例化。示例代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="kd">public</span> <span class="kd">class</span> <span class="nc">Hungry</span> <span class="o">{</span>

      <span class="kd">private</span> <span class="nf">Hungry</span><span class="o">()</span> <span class="o">{</span>
      <span class="o">}</span>

      <span class="kd">private</span> <span class="kd">static</span> <span class="kd">final</span> <span class="n">Hungry</span> <span class="n">INSTANCE</span> <span class="o">=</span> <span class="k">new</span> <span class="n">Hungry</span><span class="o">();</span>

      <span class="kd">public</span> <span class="kd">static</span> <span class="n">Hungry</span> <span class="nf">getInstance</span><span class="o">()</span> <span class="o">{</span>
	  <span class="k">return</span> <span class="n">INSTANCE</span><span class="o">;</span>
      <span class="o">}</span>

  <span class="o">}</span>
</pre></div>
<p>
饿汉式的优点是提前进行初始化，线程安全。缺点是在系统未调用的情况下占用了内存空间，是以空间换取时间的样例
</p>
</div>
</div>
<div id="outline-container-org89855e4" class="outline-2">
<h2 id="org89855e4">
<a id="ID-ED1E6C8B-3D3A-486D-916B-76A252AEED07"></a>懒汉式</h2>
<div class="outline-text-2" id="text-org89855e4">
<p>
懒汉式就是在使用才对对象实例进行初始化，达到了延迟加载的目的。示例代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="kd">public</span> <span class="kd">class</span> <span class="nc">LazyOne</span> <span class="o">{</span>

      <span class="kd">private</span> <span class="nf">LazyOne</span><span class="o">()</span> <span class="o">{</span>
      <span class="o">}</span>

      <span class="kd">private</span> <span class="kd">static</span> <span class="n">LazyOne</span> <span class="n">instance</span> <span class="o">=</span> <span class="kc">null</span><span class="o">;</span>

      <span class="kd">public</span> <span class="kd">static</span> <span class="n">LazyOne</span> <span class="nf">getInstance</span><span class="o">()</span> <span class="o">{</span>
	  <span class="k">if</span> <span class="o">(</span><span class="n">instance</span> <span class="o">==</span> <span class="kc">null</span><span class="o">)</span> <span class="o">{</span>
	      <span class="n">instance</span> <span class="o">=</span> <span class="k">new</span> <span class="n">LazyOne</span><span class="o">();</span>
	  <span class="o">}</span>
	  <span class="k">return</span> <span class="n">instance</span><span class="o">;</span>
      <span class="o">}</span>
  <span class="o">}</span>
</pre></div>
<p>
懒式式优化点使用时实例化，延迟加载。缺点是存在线程安全问题
</p>
</div>
</div>
<div id="outline-container-org9bc9ceb" class="outline-2">
<h2 id="org9bc9ceb">
<a id="ID-5448AF33-6E0A-4EC7-BA2F-CA0A52F3D61A"></a>懒汉式（线程安全版本）</h2>
<div class="outline-text-2" id="text-org9bc9ceb">
<p>
上面的写法存在线程安全问题，最简单的修改方法是加上synchronized关键字，这样就解决了线程的安全问题。示例代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="kd">public</span> <span class="kd">class</span> <span class="nc">LazyTwo</span> <span class="o">{</span>

      <span class="kd">private</span> <span class="nf">LazyTwo</span><span class="o">()</span> <span class="o">{</span>
      <span class="o">}</span>

      <span class="kd">private</span> <span class="kd">static</span> <span class="n">LazyTwo</span> <span class="n">instance</span> <span class="o">=</span> <span class="kc">null</span><span class="o">;</span>

      <span class="kd">public</span> <span class="kd">static</span> <span class="kd">synchronized</span> <span class="n">LazyTwo</span> <span class="nf">getInstance</span><span class="o">()</span> <span class="o">{</span>
	  <span class="k">if</span> <span class="o">(</span><span class="n">instance</span> <span class="o">==</span> <span class="kc">null</span><span class="o">)</span> <span class="o">{</span>
	      <span class="n">instance</span> <span class="o">=</span> <span class="k">new</span> <span class="n">LazyTwo</span><span class="o">();</span>
	  <span class="o">}</span>
	  <span class="k">return</span> <span class="n">instance</span><span class="o">;</span>
      <span class="o">}</span>
  <span class="o">}</span>
</pre></div>
<p>
加了synchronized关键字解决了线程安全问题，但是程序的并发性能下降，因为在同一时间只能有一个线程进行工作。测试生成200万个实例的情况，不带关键字synchronized耗时7ms，而带synchroized的耗时49ms，相差7倍，加大生成实例的个数，这个时间差会更大，这个版本性能的测试代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="kt">long</span> <span class="n">start</span> <span class="o">=</span> <span class="n">System</span><span class="o">.</span><span class="na">currentTimeMillis</span><span class="o">();</span>
  <span class="kt">int</span> <span class="n">count</span> <span class="o">=</span> <span class="mi">2_000_000</span><span class="o">;</span>
  <span class="k">for</span> <span class="o">(</span><span class="kt">int</span> <span class="n">i</span> <span class="o">=</span> <span class="mi">0</span><span class="o">;</span> <span class="n">i</span> <span class="o">&lt;</span> <span class="n">count</span><span class="o">;</span> <span class="n">i</span><span class="o">++)</span> <span class="o">{</span>
      <span class="n">LazyOne</span><span class="o">.</span><span class="na">getInstance</span><span class="o">();</span>
  <span class="o">}</span>
  <span class="n">System</span><span class="o">.</span><span class="na">out</span><span class="o">.</span><span class="na">println</span><span class="o">(</span><span class="s">"LazyOne use: "</span> <span class="o">+</span> <span class="o">(</span><span class="n">System</span><span class="o">.</span><span class="na">currentTimeMillis</span><span class="o">()</span> <span class="o">-</span> <span class="n">start</span><span class="o">)</span> <span class="o">+</span> <span class="s">"ms"</span><span class="o">);</span>


  <span class="kt">long</span> <span class="n">start2</span> <span class="o">=</span> <span class="n">System</span><span class="o">.</span><span class="na">currentTimeMillis</span><span class="o">();</span>
  <span class="k">for</span> <span class="o">(</span><span class="kt">int</span> <span class="n">i</span> <span class="o">=</span> <span class="mi">0</span><span class="o">;</span> <span class="n">i</span> <span class="o">&lt;</span> <span class="n">count</span><span class="o">;</span> <span class="n">i</span><span class="o">++)</span> <span class="o">{</span>
       <span class="n">LazyTwo</span><span class="o">.</span><span class="na">getInstance</span><span class="o">();</span>
  <span class="o">}</span>
  <span class="n">System</span><span class="o">.</span><span class="na">out</span><span class="o">.</span><span class="na">println</span><span class="o">(</span><span class="s">"LazyTwo use: "</span> <span class="o">+</span> <span class="o">(</span><span class="n">System</span><span class="o">.</span><span class="na">currentTimeMillis</span><span class="o">()</span> <span class="o">-</span> <span class="n">start2</span><span class="o">)</span> <span class="o">+</span> <span class="s">"ms"</span><span class="o">);</span>
</pre></div>
</div>
</div>
