posts/she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi.org
* 注册式单例
  :PROPERTIES:
  :ID:       8568E20F-C765-432E-B067-7A56A5B65C44
  :END:
  注册式单例是Spring中使用的一种产生单例的方式，主要的思想就是将要产生的单例对象使用一样map进行存储。示例代码如下：
  #+BEGIN_SRC java
  private final static Map<String, Object> singletonMaps = new ConcurrentHashMap<>();

  public static Object getBean(String beanName) {

          if (null == beanName || "".equals(beanName)) {
                  throw new RuntimeException("invalid beanName");
          }

          if (!singletonMaps.containsKey(beanName)) {

                  try {
                          synchronized (singletonMaps) {
                                  Object o = Class.forName(beanName).newInstance();
                                  singletonMaps.put(beanName, o);
                                  return o;
                          }
                  } catch (Exception e) {
                          e.printStackTrace();
                  }
          }
          return singletonMaps.get(beanName);
  }

  #+END_SRC
  Spring实际的生成单例bean的处理方式比这复杂很多。
* 静态内部类方式
  :PROPERTIES:
  :ID:       1122404E-47A2-4105-99F4-B8897118C858
  :END:
  静态内部类就是在一个类的内部又声明了一个类，静态内部类生成单例的代码如下：
  #+BEGIN_SRC java
  public class LazyThree  {

      private LazyThree() {
      }

      public static LazyThree getInstance() {
          return InstanceHolder.LAZY;
      }

      private static class InstanceHolder {
          private static final LazyThree LAZY = new LazyThree();
      }
  }
  #+END_SRC
  在类LazyThree的内部又声明了一个名为InstanceHolder的静态内部类，刚开始外部类初始化时内部类不会进行初始化，这样保留了懒加载的特性，只有在调用getInstance方法时内部类才初始化，JVM虚拟机内部的逻辑保证了在多线程情况静态内部类只给被初始化一次，这样也保证了线程的安全。但是JAVA提供我们程序员太多的方式来进行类的实例化，比如clone，反射，序列化。在这些情况下，我们的单例还是唯一的吗？
* 打破单例之Clone方式
  :PROPERTIES:
  :ID:       61706974-D481-42C7-9D99-42F27C5072DA
  :END:
  在JAVA中所有对象都继承Object对象，实例对象实现Cloneable接口则可以进行clone，示例代码如下：
  #+BEGIN_SRC java
  @Override
  public Object clone() throws CloneNotSupportedException {
          return super.clone();
  }
  #+END_SRC
  测试代码:
  #+BEGIN_SRC java
  LazyThree lazyThree = LazyThree.getInstance();
  LazyThree clone = (LazyThree) lazyThree.clone();

  System.out.println(lazyThree == clone);  //结果为false
  #+END_SRC
** 解决clone方式下产生单例不一致的问题
   :PROPERTIES:
   :ID:       040D171C-1E2F-48B0-9B91-6F71F694154E
   :END:
   实例了cloneable接口的单例对象生成的实例不相同，此时我们要做的就是重写clone方法，让其使用我们静态内部类生成的单例，示例代码如下：
   #+BEGIN_SRC java
   @Override
   public Object clone() throws CloneNotSupportedException {
           return getInstance();
   }
   #+END_SRC
   这样我们重写了clone方式，生成的单例就是一样的了
* 打破单例之反射方式
  :PROPERTIES:
  :ID:       0F5657E4-0FE0-4FB3-A3B4-D0DE0056E6E8
  :END:
  反射是JAVA的一个利器，利用反射可以实例化对象，调用方法，动态的创建对象，使用反射创建实例的代码如下：
  #+BEGIN_SRC java
  Constructor<LazyThree> constructor = LazyThree.class.getDeclaredConstructor(null);
  constructor.setAccessible(true);
  LazyThree lazyThreeReflect = constructor.newInstance(null);

  LazyThree lazyThree = LazyThree.getInstance();
  System.out.println(lazyThree == lazyThreeReflect);
  #+END_SRC
  生成的实例不是相同的，虽然我们的类已经把构造方法声明为了private，但是反射依然可以访问的到。
** 解决反射产生单例不一致的问题
   :PROPERTIES:
   :ID:       E418A027-B1C0-4A7F-84F6-70424EF2EF81
   :END:
   为了防止这种事情的发生，我们需要在构造方法上对类初始化状态进行标识来阻止类的多次初始化。代码如下：
   #+BEGIN_SRC java
   private static boolean initial = false;

   private LazyThree() {

           synchronized (LazyThree.class) {
                   if (!initial) {
                           initial = true;
                   } else {
                           throw new RuntimeException("单例被侵犯");
                   }
           }
   }
   #+END_SRC
   我们定义的一个静态变量initial来标识类有没有进行了初始化，并且不对外提供对initial变量的get与set方法。这样如实例已经初始化了，再次调用则抛出异常表明类已经被初始化了，这样就防止了使用反射方式来进行类的实例化了。
