posts/she-ji-mo-shi-xue-xi-zhi-dan-li-mo-shi/index.html
<div id="outline-container-org37a731d" class="outline-2">
<h2 id="org37a731d">
<a id="ID-8568E20F-C765-432E-B067-7A56A5B65C44"></a>注册式单例</h2>
<div class="outline-text-2" id="text-org37a731d">
<p>
注册式单例是Spring中使用的一种产生单例的方式，主要的思想就是将要产生的单例对象使用一样map进行存储。示例代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="kd">private</span> <span class="kd">final</span> <span class="kd">static</span> <span class="n">Map</span><span class="o">&lt;</span><span class="n">String</span><span class="o">,</span> <span class="n">Object</span><span class="o">&gt;</span> <span class="n">singletonMaps</span> <span class="o">=</span> <span class="k">new</span> <span class="n">ConcurrentHashMap</span><span class="o">&lt;&gt;();</span>

  <span class="kd">public</span> <span class="kd">static</span> <span class="n">Object</span> <span class="nf">getBean</span><span class="o">(</span><span class="n">String</span> <span class="n">beanName</span><span class="o">)</span> <span class="o">{</span>

	  <span class="k">if</span> <span class="o">(</span><span class="kc">null</span> <span class="o">==</span> <span class="n">beanName</span> <span class="o">||</span> <span class="s">""</span><span class="o">.</span><span class="na">equals</span><span class="o">(</span><span class="n">beanName</span><span class="o">))</span> <span class="o">{</span>
		  <span class="k">throw</span> <span class="k">new</span> <span class="n">RuntimeException</span><span class="o">(</span><span class="s">"invalid beanName"</span><span class="o">);</span>
	  <span class="o">}</span>

	  <span class="k">if</span> <span class="o">(!</span><span class="n">singletonMaps</span><span class="o">.</span><span class="na">containsKey</span><span class="o">(</span><span class="n">beanName</span><span class="o">))</span> <span class="o">{</span>

		  <span class="k">try</span> <span class="o">{</span>
			  <span class="kd">synchronized</span> <span class="o">(</span><span class="n">singletonMaps</span><span class="o">)</span> <span class="o">{</span>
				  <span class="n">Object</span> <span class="n">o</span> <span class="o">=</span> <span class="n">Class</span><span class="o">.</span><span class="na">forName</span><span class="o">(</span><span class="n">beanName</span><span class="o">).</span><span class="na">newInstance</span><span class="o">();</span>
				  <span class="n">singletonMaps</span><span class="o">.</span><span class="na">put</span><span class="o">(</span><span class="n">beanName</span><span class="o">,</span> <span class="n">o</span><span class="o">);</span>
				  <span class="k">return</span> <span class="n">o</span><span class="o">;</span>
			  <span class="o">}</span>
		  <span class="o">}</span> <span class="k">catch</span> <span class="o">(</span><span class="n">Exception</span> <span class="n">e</span><span class="o">)</span> <span class="o">{</span>
			  <span class="n">e</span><span class="o">.</span><span class="na">printStackTrace</span><span class="o">();</span>
		  <span class="o">}</span>
	  <span class="o">}</span>
	  <span class="k">return</span> <span class="n">singletonMaps</span><span class="o">.</span><span class="na">get</span><span class="o">(</span><span class="n">beanName</span><span class="o">);</span>
  <span class="o">}</span>
</pre></div>
<p>
Spring实际的生成单例bean的处理方式比这复杂很多。
</p>
</div>
</div>
<div id="outline-container-org1ff7c9e" class="outline-2">
<h2 id="org1ff7c9e">
<a id="ID-1122404E-47A2-4105-99F4-B8897118C858"></a>静态内部类方式</h2>
<div class="outline-text-2" id="text-org1ff7c9e">
<p>
静态内部类就是在一个类的内部又声明了一个类，静态内部类生成单例的代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="kd">public</span> <span class="kd">class</span> <span class="nc">LazyThree</span>  <span class="o">{</span>

      <span class="kd">private</span> <span class="nf">LazyThree</span><span class="o">()</span> <span class="o">{</span>
      <span class="o">}</span>

      <span class="kd">public</span> <span class="kd">static</span> <span class="n">LazyThree</span> <span class="nf">getInstance</span><span class="o">()</span> <span class="o">{</span>
	  <span class="k">return</span> <span class="n">InstanceHolder</span><span class="o">.</span><span class="na">LAZY</span><span class="o">;</span>
      <span class="o">}</span>

      <span class="kd">private</span> <span class="kd">static</span> <span class="kd">class</span> <span class="nc">InstanceHolder</span> <span class="o">{</span>
	  <span class="kd">private</span> <span class="kd">static</span> <span class="kd">final</span> <span class="n">LazyThree</span> <span class="n">LAZY</span> <span class="o">=</span> <span class="k">new</span> <span class="n">LazyThree</span><span class="o">();</span>
      <span class="o">}</span>
  <span class="o">}</span>
</pre></div>
<p>
在类LazyThree的内部又声明了一个名为InstanceHolder的静态内部类，刚开始外部类初始化时内部类不会进行初始化，这样保留了懒加载的特性，只有在调用getInstance方法时内部类才初始化，JVM虚拟机内部的逻辑保证了在多线程情况静态内部类只给被初始化一次，这样也保证了线程的安全。但是JAVA提供我们程序员太多的方式来进行类的实例化，比如clone，反射，序列化。在这些情况下，我们的单例还是唯一的吗？
</p>
</div>
</div>
<div id="outline-container-org3052e8e" class="outline-2">
<h2 id="org3052e8e">
<a id="ID-61706974-D481-42C7-9D99-42F27C5072DA"></a>打破单例之Clone方式</h2>
<div class="outline-text-2" id="text-org3052e8e">
<p>
在JAVA中所有对象都继承Object对象，实例对象实现Cloneable接口则可以进行clone，示例代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="nd">@Override</span>
  <span class="kd">public</span> <span class="n">Object</span> <span class="nf">clone</span><span class="o">()</span> <span class="kd">throws</span> <span class="n">CloneNotSupportedException</span> <span class="o">{</span>
	  <span class="k">return</span> <span class="kd">super</span><span class="o">.</span><span class="na">clone</span><span class="o">();</span>
  <span class="o">}</span>
</pre></div>
<p>
测试代码:
</p>
<div class="highlight"><pre><span></span>  <span class="n">LazyThree</span> <span class="n">lazyThree</span> <span class="o">=</span> <span class="n">LazyThree</span><span class="o">.</span><span class="na">getInstance</span><span class="o">();</span>
  <span class="n">LazyThree</span> <span class="n">clone</span> <span class="o">=</span> <span class="o">(</span><span class="n">LazyThree</span><span class="o">)</span> <span class="n">lazyThree</span><span class="o">.</span><span class="na">clone</span><span class="o">();</span>

  <span class="n">System</span><span class="o">.</span><span class="na">out</span><span class="o">.</span><span class="na">println</span><span class="o">(</span><span class="n">lazyThree</span> <span class="o">==</span> <span class="n">clone</span><span class="o">);</span>  <span class="c1">//结果为false</span>
</pre></div>
</div>
<div id="outline-container-org7ba6909" class="outline-3">
<h3 id="org7ba6909">
<a id="ID-040D171C-1E2F-48B0-9B91-6F71F694154E"></a>解决clone方式下产生单例不一致的问题</h3>
<div class="outline-text-3" id="text-org7ba6909">
<p>
实例了cloneable接口的单例对象生成的实例不相同，此时我们要做的就是重写clone方法，让其使用我们静态内部类生成的单例，示例代码如下：
</p>
<div class="highlight"><pre><span></span>   <span class="nd">@Override</span>
   <span class="kd">public</span> <span class="n">Object</span> <span class="nf">clone</span><span class="o">()</span> <span class="kd">throws</span> <span class="n">CloneNotSupportedException</span> <span class="o">{</span>
	   <span class="k">return</span> <span class="n">getInstance</span><span class="o">();</span>
   <span class="o">}</span>
</pre></div>
<p>
这样我们重写了clone方式，生成的单例就是一样的了
</p>
</div>
</div>
</div>
<div id="outline-container-orgd961a6a" class="outline-2">
<h2 id="orgd961a6a">
<a id="ID-0F5657E4-0FE0-4FB3-A3B4-D0DE0056E6E8"></a>打破单例之反射方式</h2>
<div class="outline-text-2" id="text-orgd961a6a">
<p>
反射是JAVA的一个利器，利用反射可以实例化对象，调用方法，动态的创建对象，使用反射创建实例的代码如下：
</p>
<div class="highlight"><pre><span></span>  <span class="n">Constructor</span><span class="o">&lt;</span><span class="n">LazyThree</span><span class="o">&gt;</span> <span class="n">constructor</span> <span class="o">=</span> <span class="n">LazyThree</span><span class="o">.</span><span class="na">class</span><span class="o">.</span><span class="na">getDeclaredConstructor</span><span class="o">(</span><span class="kc">null</span><span class="o">);</span>
  <span class="n">constructor</span><span class="o">.</span><span class="na">setAccessible</span><span class="o">(</span><span class="kc">true</span><span class="o">);</span>
  <span class="n">LazyThree</span> <span class="n">lazyThreeReflect</span> <span class="o">=</span> <span class="n">constructor</span><span class="o">.</span><span class="na">newInstance</span><span class="o">(</span><span class="kc">null</span><span class="o">);</span>

  <span class="n">LazyThree</span> <span class="n">lazyThree</span> <span class="o">=</span> <span class="n">LazyThree</span><span class="o">.</span><span class="na">getInstance</span><span class="o">();</span>
  <span class="n">System</span><span class="o">.</span><span class="na">out</span><span class="o">.</span><span class="na">println</span><span class="o">(</span><span class="n">lazyThree</span> <span class="o">==</span> <span class="n">lazyThreeReflect</span><span class="o">);</span>
</pre></div>
<p>
生成的实例不是相同的，虽然我们的类已经把构造方法声明为了private，但是反射依然可以访问的到。
</p>
</div>
<div id="outline-container-orgb0c49f3" class="outline-3">
<h3 id="orgb0c49f3">
<a id="ID-E418A027-B1C0-4A7F-84F6-70424EF2EF81"></a>解决反射产生单例不一致的问题</h3>
<div class="outline-text-3" id="text-orgb0c49f3">
<p>
为了防止这种事情的发生，我们需要在构造方法上对类初始化状态进行标识来阻止类的多次初始化。代码如下：
</p>
<div class="highlight"><pre><span></span>   <span class="kd">private</span> <span class="kd">static</span> <span class="kt">boolean</span> <span class="n">initial</span> <span class="o">=</span> <span class="kc">false</span><span class="o">;</span>

   <span class="kd">private</span> <span class="nf">LazyThree</span><span class="o">()</span> <span class="o">{</span>

	   <span class="kd">synchronized</span> <span class="o">(</span><span class="n">LazyThree</span><span class="o">.</span><span class="na">class</span><span class="o">)</span> <span class="o">{</span>
		   <span class="k">if</span> <span class="o">(!</span><span class="n">initial</span><span class="o">)</span> <span class="o">{</span>
			   <span class="n">initial</span> <span class="o">=</span> <span class="kc">true</span><span class="o">;</span>
		   <span class="o">}</span> <span class="k">else</span> <span class="o">{</span>
			   <span class="k">throw</span> <span class="k">new</span> <span class="n">RuntimeException</span><span class="o">(</span><span class="s">"单例被侵犯"</span><span class="o">);</span>
		   <span class="o">}</span>
	   <span class="o">}</span>
   <span class="o">}</span>
</pre></div>
<p>
我们定义的一个静态变量initial来标识类有没有进行了初始化，并且不对外提供对initial变量的get与set方法。这样如实例已经初始化了，再次调用则抛出异常表明类已经被初始化了，这样就防止了使用反射方式来进行类的实例化了。
</p>
</div>
</div>
</div>
